app/Http/Controllers/AuthorController.php

select * from `tbl_author` order by `author_id` desc
---
    public function all_author(){
        $this->AuthLogin();
    	$all_author = DB::table('tbl_author')->orderby('author_id','desc')->get();

select * from `tbl_author` where `author_id` = '9'
---
    public function edit_author($id){
        $this->AuthLogin();
    	$edit_author = DB::table('tbl_author')->where('author_id',$id)->get();

update `tbl_author` set `author_name` = 'Nguyễn Nhật Ánh', `author_desc` = 'Nguyễn Nhật Ánh (sinh ngày 7 tháng 5 năm 1955) là một nhà văn người Việt. Ông được biết đến qua nhiều tác phẩm văn học về đề tài tuổi mới lớn, các tác phẩm của ông rất được độc giả ưa chuộng và nhiều tác phẩm đã được chuyển thể thành phim.', `author_image` = 'Nguyen_Nhat_Anh77.jpg' where `author_id` = '8'
---
    public function update_author(Request $request, $id){
        $this->AuthLogin();
    	$data = array();
    	$data['author_name'] = $request->author_name;
    	$data['author_desc'] = $request->author_desc;

        $get_image = $request->file('author_image');
        if($get_image){
            $get_name_image = $get_image->getClientOriginalName();
            $name_image = current(explode('.', $get_name_image));
            $new_image = $name_image.rand(0,99).'.'.$get_image->getClientOriginalExtension();
            $get_image->move('public/uploads/author', $new_image);
            $data['author_image'] = $new_image;
            DB::table('tbl_author')->where('author_id',$id)->update($data);

select * from `tbl_category_product` where `category_status` = '1' order by `category_id` desc
select * from `tbl_author` where `author_status` = '1' order by `author_id` desc
select * from `tbl_product` where `product_status` = '1' order by `product_id` desc limit 4
select * from `tbl_product` inner join `tbl_author` on `tbl_product`.`author_id` = `tbl_author`.`author_id` where `tbl_author`.`author_id` = '4'
select * from `tbl_author` where `tbl_author`.`author_id` = '4' limit 1
---
    public function show_author_home($id){

        $cate_product = DB::table('tbl_category_product')->where('category_status','1')->orderby('category_id','desc')->get();
        $author = DB::table('tbl_author')->where('author_status','1')->orderby('author_id','desc')->get();
        $SpBanChayNhat = DB::table('tbl_product')->where('product_status','1')->orderby('product_id','desc')->limit(4)->get();

        $productByIdAuthor = DB::table('tbl_product')->join('tbl_author', 'tbl_product.author_id','=','tbl_author.author_id')->where('tbl_author.author_id',$id)->get();

        $author_name = DB::table('tbl_author')->where('tbl_author.author_id', $id)->limit(1)->get();