app/Http/Controllers/CartController.php

    public function save_cart(Request $request){
    	$productId = $request->productid_hidden;
    	$product_info = DB::table('tbl_product')->where('product_id', $productId)->first();
---
select * from `tbl_product` where `product_id` = '2' limit 1