app/Http/Controllers/CheckoutController.php

select * from `tbl_category_product` where `category_status` = '1' order by `category_id` desc
select * from `tbl_author` where `author_status` = '1' order by `author_id` desc
select * from `tbl_product` where `product_status` = '1' order by `product_id` desc limit 4
---
    public function checkout(){
    	$cate_product = DB::table('tbl_category_product')->where('category_status','1')->orderby('category_id','desc')->get();
        $author = DB::table('tbl_author')->where('author_status','1')->orderby('author_id','desc')->get();
        $SpBanChayNhat = DB::table('tbl_product')->where('product_status','1')->orderby('product_id','desc')->limit(4)->get();

select * from `tbl_category_product` where `category_status` = '1' order by `category_id` desc
select * from `tbl_author` where `author_status` = '1' order by `author_id` desc
select * from `tbl_product` where `product_status` = '1' order by `product_id` desc limit 4
---
    public function payment(){
        $cate_product = DB::table('tbl_category_product')->where('category_status','1')->orderby('category_id','desc')->get();
        $author = DB::table('tbl_author')->where('author_status','1')->orderby('author_id','desc')->get();
        $SpBanChayNhat = DB::table('tbl_product')->where('product_status','1')->orderby('product_id','desc')->limit(4)->get();

select `tbl_order`.*, `tbl_shipping`.`shipping_name` from `tbl_order` inner join `tbl_shipping` on `tbl_order`.`shipping_id` = `tbl_shipping`.`shipping_id` order by `tbl_order`.`order_id` desc
---
    public function manage_order(){

        $this->AuthLogin();
        $all_order = DB::table('tbl_order')
        ->join('tbl_shipping','tbl_order.shipping_id','=', 'tbl_shipping.shipping_id')
        ->select('tbl_order.*','tbl_shipping.shipping_name')
        ->orderby('tbl_order.order_id','desc')->get();

select `tbl_order`.*, `tbl_order_details`.*, `tbl_shipping`.* from `tbl_order` inner join `tbl_shipping` on `tbl_order`.`shipping_id` = `tbl_shipping`.`shipping_id` inner join `tbl_order_details` on `tbl_order`.`order_id` = `tbl_order_details`.`order_id` where `tbl_order`.`order_id` = '3'
select `tbl_order`.*, `tbl_order_details`.*, `tbl_shipping`.* from `tbl_order` inner join `tbl_shipping` on `tbl_order`.`shipping_id` = `tbl_shipping`.`shipping_id` inner join `tbl_order_details` on `tbl_order`.`order_id` = `tbl_order_details`.`order_id` where `tbl_order`.`order_id` = '3' limit 1
---
    public function view_order($id){
        $this->AuthLogin();

        $order_by_id = DB::table('tbl_order')
        ->join('tbl_shipping','tbl_order.shipping_id','=', 'tbl_shipping.shipping_id')
        ->join('tbl_order_details','tbl_order.order_id','=', 'tbl_order_details.order_id')
        ->select('tbl_order.*','tbl_order_details.*','tbl_shipping.*')
        ->where('tbl_order.order_id',$id)
        ->get();

        $order_by_id1 = DB::table('tbl_order')
        ->join('tbl_shipping','tbl_order.shipping_id','=', 'tbl_shipping.shipping_id')
        ->join('tbl_order_details','tbl_order.order_id','=', 'tbl_order_details.order_id')
        ->select('tbl_order.*','tbl_order_details.*','tbl_shipping.*')
        ->where('tbl_order.order_id',$id)
        ->first();