app/Http/Controllers/HomeController.php

    public function index(){

    	$cate_product = DB::table('tbl_category_product')->where('category_status','1')->orderby('category_id','desc')->get();

    	$author = DB::table('tbl_author')->where('author_status','1')->orderby('author_id','desc')->get();

    	$all_product = DB::table('tbl_product')->orderby('product_id','desc')->limit(8)->get();

    	$SpBanChayNhat = DB::table('tbl_product')->where('product_status','1')->orderby('product_id','desc')->limit(4)->get();
---
select * from `tbl_category_product` where `category_status` = '1' order by `category_id` desc
select * from `tbl_author` where `author_status` = '1' order by `author_id` desc
select * from `tbl_product` order by `product_id` desc limit 8
select * from `tbl_product` where `product_status` = '1' order by `product_id` desc limit 4

    public function tim_kiem(Request $request){
    	$cate_product = DB::table('tbl_category_product')->where('category_status','1')->orderby('category_id','desc')->get();

    	$author = DB::table('tbl_author')->where('author_status','1')->orderby('author_id','desc')->get();

    	$SpBanChayNhat = DB::table('tbl_product')->where('product_status','1')->orderby('product_id','desc')->limit(4)->get();

    	$keywords = $request -> keywords_submit;

    	$search_product = DB::table('tbl_product')->where('product_name','like','%'.$keywords.'%')->get();
---
select * from `tbl_category_product` where `category_status` = '1' order by `category_id` desc
select * from `tbl_author` where `author_status` = '1' order by `author_id` desc
select * from `tbl_product` where `product_status` = '1' order by `product_id` desc limit 4
select * from `tbl_product` where `product_name` like '%vội vàng%'